{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Jackson",
	"language": "en",
	"home_page_url": "https://jackson.gd/",
	"feed_url": "https://jackson.gd/feed/feed.json",
	"description": "Hello, I&#39;m Jackson.",
	"author": {
		"name": "Jackson",
		"url": "https://jackson.gd/me/"
	},
	"items": [
		{
			"id": "https://jackson.gd/blog/2023-07-19-montreal/",
			"url": "https://jackson.gd/blog/2023-07-19-montreal/",
			"title": "Montreal",
			"content_html": "<p>I didn't think  I would end up in Montreal. I think my only awareness of the city was a unit on Quebec within my French class in middle/highschool. Even then, the recollections I have are of maple syrup dripped over snow, poutine, bitter winters and ice sculptures.</p>\n<p>However, it came more into focus during the last years of undergrad where thoughts towards the future, my continued education within Cognitive Science, were looming. McGill had a department and program in neuroscience which I had mentioned to my fellow cog-sci classmates thinking it would be a cool program abroad (though Canada in my mind felt far less international than anywhere else.) And I've been considering moving from Long Beach, and Montreal was always a place on my list.</p>\n<p>While I ended up not pursuing down that road, remarkably, one of those close friends I mentioned this program to did! She is now close to finishing a PhD in Neuroscience studying the effects of canabanoids during prenatal development in mice. I was able to visit her during the warmest period in Montreal (flight likely discounted by the raging wildfires) and so became quite enamoured with a beautiful été in Montreal.</p>\n<h2 id=\"french\" tabindex=\"-1\">French <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#french\">#</a></h2>\n<p>I knew there was a French influence historically (and presumably more linguistically now) but I had no idea the range to which French somewhat dominates the city (and provence) in a largely Anglophone part of the world. I was told (paraphrasing now by word of mouth) of the historical and economical (class) divide between the English speaking population and French and the historical disparity of capital and political representation that has come to represent. I was given a short history lesson from my friend's partner's mother who joined us one lunch. She has migrated from Durham, North Carolina (of all places!) and had a strong sense of Montreal's history and culture.</p>\n<p>The wealthy English population took the spoils and political power during the spoils of <a href=\"https://en.wikipedia.org/wiki/Battle_of_the_Plains_of_Abraham\">the war</a> and largely assimilated with the rest of English speaking Canada, leaving Francophones as a kind of second-class citizen. The power flipped in the 70s with the French party finally taking seats and representing Quebec and along with it, legislation to preserve French as the first language spoken in Quebec. This means oddly specific sign laws that require French being on and often above English whenever a public sign is made and requirements that any new students migrating to Quebec be taught in French-language schools (the only exception if both parents when to English speaking schools in Quebec).</p>\n<h2 id=\"today\" tabindex=\"-1\">Today <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#today\">#</a></h2>\n<p>But this admirable push to preserve their historical uniqueness has also resulted in some unusual consequences. One is a practical isolation from opportunities within the rest of Canada and the US. Those learning French alone will inevitably struggle with the English world that surrounds them. The second is the much more unique cultural and political shifts that appeared more progressive than typically found in North America. This could be felt even whilst roaming the streets.</p>\n<p>I imagine Montreal, as the seat of Quebec, will move forward on a little bit of it's own axis. Meaning, it's feels while Montreal is already quite an international city, it is a city that is actively fighting <em>for</em> a more linguistically diverse population. This is in contrast to the US where we are just starting to acknowledge that instructing children in English, who's native language or home language, is to exclude a richness of diversity (and all that entails) into the US for the sake of assimilation into a world that reflects the past. Because of these efforts to revitalize and reintegrate French on a prominently non-French side of the world (both North and South), Montreal will have to contend and fight for a kind of right to a cultural and linguistic independence (not sure if there's enough momentum to succeed but it's on the minds of the radicals!)</p>\n<h2 id=\"sights\" tabindex=\"-1\">Sights <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#sights\">#</a></h2>\n<p>I walk quite a lot. I'm heavily inspired by other walkers like <a href=\"https://walkingtheworld.substack.com/\">Chris Arnade</a> and <a href=\"https://pedestrian.substack.com/\">Alex Wolfe</a>. These are people who are incredibly gifted at journaling around the worlds they walk in. For me at least, walking is a unique way of knowing the world you're in that tangibly connects you with the places and people that exist there. This experience (which I might blog on some later time) reminds me of Baudelaire's flâneur, an aloof sort of person who saunters through urban modernity with a philosophical eye.</p>\n<p>The architecture is this mix of sort of French European and American or maybe what would be like sort of North American, Canadian But the policies of the US have clear impacts, especially the commercial and the businesses that reside within the US have definitely taken a strong foothold in Canada as well. It makes sense given the geographical proximity.</p>\n<p>I think biking, walkability, public transportation here are all very European in flavor. Likely due to early involvement of the French in city planning and transit systems. I mean the French were huge developers of train systems in Taiwan and Vietnam, I mean that has like colonial history but it makes sense why Montreal and maybe Quebec generally has a lot of really good well thought-out public transit.</p>\n<h3 id=\"tipping\" tabindex=\"-1\">Tipping <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#tipping\">#</a></h3>\n<p>One odd thing is tipping culture. Why is it here? I would suspect or I would have suspected that such a huge complaint of like French tourists visiting the US and from chatting with like Europeans generally is that the tipping culture in the US is kind of a landmark folly that really represents more than just some nostalgic relic of the &quot;friendly American culture&quot; (read white, middle-class, suburbia), it represents clear exploitation in the service industry, a failure of the working class to rally around fair compensation, and how culture wars so easily distract us from class struggle.</p>\n<p>Most Europeans think the whole concept is ridiculous and I think a lot of French tourists, many of whom packed the hostels, would think the same. I'm sure it's leaked over from the US and might represent a much more similar service industry to the US than Europe.</p>\n<h3 id=\"cafes\" tabindex=\"-1\">Cafés <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#cafes\">#</a></h3>\n<p>Given that, café culture is huge and the cafés are better compared to the US. It seems like people care more about the accessibility and quality of a place it get a cup of coffee in the neighborhood. Likely due to the poor city planning in most American cities, the neighborhood café has been replaced with a suburban sprawl and lacks the charming nooks found in older European cities since no one wants to walk an hour out of your cul-de-sac to get to a café.</p>\n<h3 id=\"buildings\" tabindex=\"-1\">Buildings <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#buildings\">#</a></h3>\n<p>The city also does a good job of creating a lot of of beautiful and seemingly affordable public housing. It reminds me a lot of Oslo where a lot of apartments were built thoughtfully. They're placed in good locations and it seems like most folks get a much bigger window or a balcony. Again, these are likely nicer areas, but even in denser neighborhoods reminiscent of New York or Brooklyn, there seems to be enough open space and yards for people to make their own. That also applies to the skyline as well.</p>\n<p>And it's also felt that Montreal has built alongside history, something not so common of North America (most history has been eradicated physically and culturally from Turtle Island). Montreal is lucky in the sense that it was settled in 1642 and has seen a bunch of growth after a slow period in the 80's and 90's. A lot of the old brick, industrial aesthetic blends within new constructions and renovations. Even when the brick looks new, it maintains a modern yet industrial vibe that fits with the surrounding buildings. There is near <em>constant</em> construction and repairs of the roads. It's a fun challenge navigating by bike in the city.</p>\n<h3 id=\"coming-back\" tabindex=\"-1\">Coming back <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-07-19-montreal/#coming-back\">#</a></h3>\n<p>I'm excited to return to Montreal next year (for a wedding), if only it remained as beautiful and temperate in the winter!</p>\n",
			"date_published": "2023-08-01T00:00:00Z"
		}
		,
		{
			"id": "https://jackson.gd/blog/2023-06-03-thought/",
			"url": "https://jackson.gd/blog/2023-06-03-thought/",
			"title": "Thinking out Loud",
			"content_html": "<h1 id=\"publishing-thoughts\" tabindex=\"-1\">Publishing Thoughts <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2023-06-03-thought/#publishing-thoughts\">#</a></h1>\n<p>I've been wanting an excuse to publicize more stuff.</p>\n<p>A big barrier to making material public is of course the packaging. Sure an idea or a project might be cool, but you're never able to communicate this information in the same way that you might in person in conversation. It's always felt to me that if you are in full control of the platform - like on a personal website or blog - the ideas your publish ought to be at least a little polished.</p>\n<p>I recently watched a video from a YouTuber that creates long-form essays about contemporary cultural phenomenon. He had made a second channel just for fun that published little small anecdotes (<a href=\"https://www.youtube.com/watch?v=XWVHGHRUrss\">here's one</a>).</p>\n<p>It echos a general feeling around what we consider as &quot;work&quot; or &quot;productive&quot; or &quot;skilled&quot; that I've been trying to get a pulse on. How the things we do, once we have an expected level of quality from our personal work, become far less rewarding, far less exploratory, and often result in more conservative choices we make along the way.</p>\n<p>I'll hopefully write a lot more like this, shorter blerbs, littered with mistakes, that might turn into longer thoughts and constructions. Maybe it will serve as a public journal or something with an audience in mind. As long as it's out here!</p>\n",
			"date_published": "2023-06-03T00:00:00Z"
		}
		,
		{
			"id": "https://jackson.gd/blog/2019-10-01-memory-avalanches/",
			"url": "https://jackson.gd/blog/2019-10-01-memory-avalanches/",
			"title": "Memory and Modality through The Avalanches&#39; Wildflower and &quot;The Was&quot;",
			"content_html": "<figure><img src=\"https://jackson.gd/img/avalanches.webp\" style=\"aspect-ratio: 16/9;\" alt=\"The Avalanches in the early 2000's\"><figcaption>The Avalanches in the early 2000's</figcaption></figure>\n<p>For many, music leaves some of the deepest impressions we have during our lifetime. One's favorite song might often trigger a flashback, with a sudden return to those past moments they shared with the sound. These returns are accompanied with a flood of detailed sensory information that spread across our senses in what might be called an <em>episodic memory</em>. As we can appreciate in these moments, our memories are wrapped in complex, multi-modal associations that are encoded within our hippocampus, thalamus, amygdala, and various areas of our cortex. Thus, the act of recalling episodic memories stimulates these neural pathways just as they were activated when we first consolidated the memory. Björn Vickhoff explains the process wonderfully in his <em>A Perspective Theory of Music Perception and Emotion</em>,</p>\n<blockquote>\n<p>&quot;Even if the information is integrated in the hippocampus and the hippocampus is associated with long-term memory this does not mean that all memories are stored in the hippocampus. Rather the information is fed back to the perception and association areas. Episodic memorizing is to reactivate the perception process. This is what makes episodic memories so vivid. The process can be activated by any contextual cue. Since we live the event anew, this is by definition imagery. I believe that imagery and episodic memory is connected&quot; (Vickhoff 2008).</p>\n</blockquote>\n<p>Something as simple as the almost tangible link between the smell of freshly baked cookies and one's grandmother is a product of the widely encoded information integrated upon each of our experiences, especially those experienced with strong emotion or personal meaning. Stefan Koelch describes this musicogenic meaning of musical &quot;relations comprise memory representations… as well as associations with regard to an individual's most personal inner experiences&quot; (Koelch, 2011). I would like to explore this phenomenon through the lens of music cognition, focusing chiefly on how our modalities contribute to an experience of music that can transport us through memory and nostalgia.</p>\n<figure>\n\t\t\t\t<lite-youtube videoid=\"MFEZiMyfSYI\">\n\t\t\t\t\t<button type=\"button\" class=\"lty-playbtn\">\n\t\t\t\t\t\t<span class=\"lyt-visually-hidden\">Every Sample From The Avalanches' Since I Left You</span>\n\t\t\t\t\t</button>\n\t\t\t\t</lite-youtube>\n\t\t\t\t<figcaption>Every Sample From The Avalanches' Since I Left You</figcaption>\n\t\t\t</figure>\n<p>The Avalanches' <em>Since I Left You</em> is an album composed as a collage of thousands (~3500) of samples of records, movies, tv shows, and advertisements before it. This genre of music takes many names, but aligns within the traditions of plunderphonics. For The Avalanches, the absence of original musical material makes their record absolutely drenched in cue, reference, and signposts from the past. Their employment of appropriation, while frowned upon by musical history as a whole, allows their music to reach into the past and re-contextualize the samples they use within new frames of reference. While one could write an entire essay on these transformations alone, the effect of this method of production provides a massive launchpad from which we can dive into memory and nostalgia, both personal and cultural. However, the effect of this experience is, incredibly, a product of only our listening; how, then, would our experience change once we integrate a visual element such as that of an accompanying video?</p>\n<figure>\n\t\t\t\t<lite-youtube videoid=\"3VN93T7m0-U\">\n\t\t\t\t\t<button type=\"button\" class=\"lty-playbtn\">\n\t\t\t\t\t\t<span class=\"lyt-visually-hidden\">The Was, Soda_Jerk</span>\n\t\t\t\t\t</button>\n\t\t\t\t</lite-youtube>\n\t\t\t\t<figcaption>The Was, Soda_Jerk</figcaption>\n\t\t\t</figure>\n<p>For the release of their second album, <em>Wildflower,</em> The Avalanches collaborated with video artist Soda_Jerk to produce a music video well suited for plunderphonics. &quot;The Was&quot; is an audiovisual piece that mimics the stylistic composition of The Avalanches' audio production in visual form. Set to a mix of songs from the album, &quot;The Was&quot; samples from films, music videos, TV and cartoons of the past in an effort to visualize the sonic collage of the past The Avalanches managed to build. The multi-sensory experience of enjoying &quot;The Was&quot; is a journey through the cultural iconography of the past and, as such, 1) directs the listener to marry the sound of _Wildflower* to the visual media of the past, 2) invites them to revisit memories of these audiovisual relics and the atmospheres of sentiment that are evoked, and 3) forms new meaningful associations between these samples and their personal memories, neurally and semantically.</p>\n<figure>\n    <img width=\"300\" height=\"300\" src=\"https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/43/b3/7e/43b37e75-6027-0d59-5f76-5a68219c82e3/source/600x600bb.jpg\">\n    <figcaption>Wildflower, The Avalanches</figcaption>\n</figure>\n<p>Like their past works, <em>Wildflower</em> uses found sound and sonic elements from unauthored music evoke a sense of nostalgia for a period across which their samples are spread. 16 years after the release of their seminal album, <em>Since I Left You</em>, The Avalanches made a return to the music scene with a new record, that continued their re-contextualization of sound that might be a little more in touch with today. While the album consists primarily of found and sampled sound, some tracks feature collaborations with contemporary artists that contribute new vocal or instrumental material. When one listens to <em>Wildflower</em>, they can hear the vintage quality of these samples, many of which have been lifted from wax. Mixing and mastering techniques and styles emblematic of their respective decade imbue these samples with their recording period, even as they have been chopped, processed, and reoriented within a new mix. Listening to &quot;Sunshine&quot; or &quot;Harmony&quot; one can hear vocal and string arrangements of the late 60's, early 70's with that characteristic lush quality diminished high end, reminding one of the easy-listening, blue-eyed soul period of the era. It might bring to mind the Summer of Love and a collection of artists (The Mamas and Papas, The Beach Boys, The Monkees etc.) that saturated the era.</p>\n<figure>\n    <img width=\"400\" src=\"https://images.squarespace-cdn.com/content/561c0052e4b0faa1a2071248/1486512095702-AMS4W285ORMY5M71KOF8/00864-Summer-of-Love-1967-Travels-with-Gloria-travelswithgloria.wordpress.com-pic.jpg?format=1500w&content-type=image%2Fjpeg\">\n    <figcaption>The Summer of Love, <a href=\"https://www.visitfishermanswharf.com/events/summeroflove\">Fisherman's Wharf</a></figcaption>\n</figure>\n<p>All of these auditory cues may very well stimulate episodic memories, the phenomenon that Davies calls the &quot;Darling, They're Playing Our Tune&quot; (DTPOT) theory of musical response (Davies, 1978). Something like Hal Blaine's <a href=\"https://musicforants.com/post/123994305022/be-my-baby-drum-beat-mix\">iconic drum intro</a> into &quot;Be My Baby&quot; is immediately recognizable for many and likely there is a strong emotional response from those who are familiar of the song and the era. While direct reference to exact sonic material may not be recognizable for many within The Avalanches densely packed quilts of samples, it is the textural quality of this vintage sound, transposed through time, that is central to our experience of nostalgia. Admittedly, this task of sending listeners back into the past is might not be accessible for many without the musical history or associations. Thus, many musicians create video projects to supplement the artwork through a new sensory experience.</p>\n<p>&quot;The Was&quot; splits <em>Wildflower</em> open and allows us to understand the work within a different modality that achieves a parallel effect, employing appropriation and composition to produce a video collage of cultural iconography. Film may be one of these mediums where we contextualize music and develop an understanding of what this past was emblematic of (even if it wasn't experienced).</p>\n<p>Soda_Jerk deftly builds a visual story through the arrangement of 171 films, many of them situated as (cult) classics of counter culture in their respective era. Scenes from media of the past unfold like a travel log set to a mix of <em>Wildflower</em>. In this way, the multi-sensory experience provides an even greater wealth of signs from which we may experience our memories from the past once more. But what's new new now, is the experience of having these scattered audio and visual exchanges, dating as far back as half a century ago, enter into dialogue with one another.</p>\n<p>The conversation that exists when watching &quot;The Was&quot; connects the information we are receiving through both modalities, neurally and symbolically, the result spread across our memory systems. Considering the research suggesting that the consolidation and retrieval of memory is inherently bound within the cognitive structures like the hippocampus and cortex, one can imagine that their pre-existing memories recalled by the music and filmography of &quot;The Was&quot; are interwoven, encompassing now hundreds of audiovisual points of contact. After a viewing, the audience has been carried through time, visually, aurally, and perhaps emotionally and experientially, through memory.</p>\n<p><em>Wildflower</em> and &quot;The Was&quot; exemplify the power of re-contextualization as an apparatus of art making and the cognitive mechanisms able to form and reform rich personal memories. Experienced as a single modality, music provides more than enough sensory information (especially for musicians) that can drive us back to the moments and sentiments we've shared with the sound over our life. But once we add a secondary sensory experience, one as stimulating as video, we face a cross-modal event. Music videos and audiovisual projects alike arrange complex and disruptive encounters that seek to reorder and enhance the multimedia experience through our own involvement in the assimilation of audio/visual stimuli and sentimentality.</p>\n<h2 id=\"works-cited\" tabindex=\"-1\">Works Cited <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2019-10-01-memory-avalanches/#works-cited\">#</a></h2>\n<p class=\"citation\">Davies, John Booth. (1978). <em>The Psychology of Music</em>. Retrieved from <a href=\"https://jackson.gd/blog/2019-10-01-memory-avalanches/\"></a></p>\n<p class=\"citation\">Groussard, Mathilde, et al.. (2010). <em>When Music and Long-Term Memory Interact: Effects of Musical Expertise on Functional and Structural Plasticity in the Hippocampus</em>. Retrieved from <a href=\"https://doi.org/10.1371/journal.pone.0013225\">https://doi.org/10.1371/journal.pone.0013225</a></p>\n<p class=\"citation\">Koelsch, Stefan. (2011). <em>Toward a Neural Basis of Music Perception – A Review and Updated Model</em>. Retrieved from <a href=\"https://doi.org/10.3389/fpsyg.2011.00110\">https://doi.org/10.3389/fpsyg.2011.00110</a></p>\n<p class=\"citation\">Koelsch, Stefan. (2011). <em>Towards a Neural Basis of Processing Musical Semantics</em>. Retrieved from <a href=\"https://doi.org/10.1016/j.plrev.2011.04.004\">https://doi.org/10.1016/j.plrev.2011.04.004</a></p>\n<p class=\"citation\">Elektra / Wea. (2001). <em>Since I Left You</em>. Retrieved from <a href=\"https://jackson.gd/blog/2019-10-01-memory-avalanches/\"></a></p>\n<p class=\"citation\">Snyder, Bob. (2001). <em>Music and Memory: An Introduction</em>. Retrieved from <a href=\"https://jackson.gd/blog/2019-10-01-memory-avalanches/\"></a></p>\n<p class=\"citation\">YouTube. (2016). <em>The Was</em>. Retrieved from <a href=\"https://www.youtube.com/watch?v=3VN93T7m0-U\">https://www.youtube.com/watch?v=3VN93T7m0-U</a></p>\n<p class=\"citation\">Vickhoff, Björn. (2008). <em>A Perspective Theory of Music Perception and Emotion</em>. Retrieved from <a href=\"https://gupea.ub.gu.se/handle/2077/9604\">https://gupea.ub.gu.se/handle/2077/9604</a></p>\n<p class=\"citation\">Astralwerks. (2016). <em>Wildflower</em>. Retrieved from <a href=\"https://jackson.gd/blog/2019-10-01-memory-avalanches/\"></a></p>",
			"date_published": "2019-10-01T00:00:00Z"
		}
		,
		{
			"id": "https://jackson.gd/blog/2018-11-02-43-rpm/",
			"url": "https://jackson.gd/blog/2018-11-02-43-rpm/",
			"title": "43 rpm",
			"content_html": "<h3 id=\"title-card\" tabindex=\"-1\">Title Card <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#title-card\">#</a></h3>\n<blockquote>\n<p>“Indeed a lake is within me, solitary and self-contained;\nbut the river of my love draws it off-down to the sea!”</p>\n</blockquote>\n<p>Cut from black. A shot of the sky in silence. Branches of trees are tugged by the wind and framed in a blue tarp, half-filled with clouds. After a few moments, inches above the grassy ground is the top half of Clover on her back, watching the sky. A thick head of opal brown hair, filled with shades of red, is spread over the grass and over an oversized white t-shirt she’s wearing. Clover’s face is freckled and pale. Hers eyes are set neatly under her thick eyebrows, and have low rings under them, making her whole gaze look deeply fatigued but at peace. Sound of those heavy branches in the wind fade in, and after half a minute, the shot cuts to the same angle from looking up at ceiling of her room, light blue with a ceiling fan slowly rotating.</p>\n<h3 id=\"room\" tabindex=\"-1\">Room <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#room\">#</a></h3>\n<p>A woman in her late forties, Diane, is seen sitting on a chair in the corner of Clover’s dorm, peacefully watching her sleep. In this moment, the sound of the wind, which has persisted through the transition, begins to shift to the ring of a radiator and the ruffling of sheets can be heard behind the shot. It’s around 9am and soft light pours in from an adjacent window. A number of angles from Clover’s room are shown; her dresser below the window, jackets and leggings retreated in corners are Diane is gone now. From a desk at the height of her bed, Clover is beginning to wake up but has rolled over to face the wall bordering her bed. Her hair is spread out over her pillow, which is a light blue, like the sheets. A cell phone rings, vibrating the sheets and lighting up the wall where she’s curled up. The shot moves to her face where a fly has landed on her cheek.</p>\n<h3 id=\"office\" tabindex=\"-1\">Office <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#office\">#</a></h3>\n<p>As she weakly swipes it away, the scene cuts to Clover now sits in a warmly lit office, it’s mid-afternoon and Clover’s sitting in a wide blue sofa, a dark green button down and jeans, with one leg tucked under her. The area is clean with lots of windows, a desk, sofa, and two chairs. Diane sits in a chair opposing Clover. Diane has a posture that seems to have grown only more elegant in age. She wears a gray cardigan too big for her shoulders slouches over her thin frame. She has short graying hair, thin glasses, and the lean face of an athlete or someone the sun had gifted with agelessness. She keeps a pen and pad by her side, looking carefully at Clover’s withdrawn daze. On the walls are various generic landscapes that were most likely picked up at yard-sales.</p>\n<p><strong>Diane:</strong> &quot;Well, its good to see you again.&quot; A small smile forms from a pair of even smaller lips.</p>\n<p><strong>Clover:</strong> &quot;You too” And she turns to face Diane, flashing a smile.</p>\n<p><strong>D:</strong> “So, how have things been going this week?”</p>\n<p><strong>C:</strong> “They've been good. I think things are getting better, but you know you can never be sure right away.” She pauses “But, yeah, definitely better than last week.”</p>\n<p><strong>D:</strong> “Right, well… good!” She take a moment to look at Clover once more. Her gaze falls to the note pad. “And it's all about progress, you know, one week at a time. Some weeks might be better, like this one, others worse and as long as we’re working on it, we’ll be exploring more and more solutions.”</p>\n<p><strong>C:</strong> “Yeah,&quot; Clover responds, looking more earnest than she believes.</p>\n<p><strong>D:</strong> “So, how have you been able to sleep recently since our last suggestions, with writing and-?”</p>\n<p><strong>C:</strong> “Yeah, yeah, it’s better, it's hard to make time for it some nights. But its been fun taking my mind off of things before bed. It's still tough since, eventually, I'll have to decide to quit writing and try sleeping&quot; she pauses &quot;and that's when I start to struggle again. I wish I could write myself to sleep, but my hand gets tired faster than my brain.&quot; She continues, &quot;My teacher told me almonds could help too?&quot;</p>\n<p><strong>D:</strong> “Yeah, I’ve heard that too, some nutritionists believe a handful might help some people before bed, though I'm not sure why, so don't take my word for it&quot; she chuckles but becomes more serious. &quot;But I’m glad you’ve been trying out writing. If I may ask, what kinds of things do you usually write about?”</p>\n<p><strong>C:</strong> “Oh, um, its mostly just my imagination.” Clover brings her hands to rub her neck. She looks uncomfortable, almost guilty, as she thinks about her answer.</p>\n<p>After she finishes, the camera stays on her, listening to Diane. The sound of her voice drifts (pans left) and fades into the distance, the buzzing of a fly intensifies (panned right). She gets distracted and watches the insect fly upwards towards Clover’s ceiling fan, in a cut back to her bedroom.</p>\n<h3 id=\"room-1\" tabindex=\"-1\">Room <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#room-1\">#</a></h3>\n<p>Clover is groggily staring at her phone. After a few seconds of reading. she frantically shakes out of bed, her long brown hair swings with her, as she hops into jeans, sneakers, a sweater and grabs her keys from the top of a dresser and slams the door. The fly comes to rest on her blanket, which has now settled on the hardwood floor, among other scattered miscellanies. Her running feet are heard outside along the hall for a moment, soon, out of audible range. From the inside of the dorm-rooms, Clover’s feet are seen sprinting past a series of doorways. The sound of her stomps is now being followed, along with heavy breath, from one hall to the next, on and off carpet and wood and finally down a stairwell. Her feet are followed from behind, as the run down the last hall and are trailed through the exit.</p>\n<p>A heavy wooden door of the dorm bursts open with the sound of birds chirping in the early morning. Clover looks around the campus as if expecting to find the source of her stress, still panting from her run through the halls. She slowly leans over, her hands on her knees, breathing erratically, trying to find a natural pace of breath again with whispered counts upwards from “one”. The campus is empty, and a wide shot puts Clover in a yard where other tall and thin dormitories are sat side by side like studious guardians. Suddenly, the sound of her name being shouted has grown in volume, enough to break through her breaths. Clover stops breathing and quickly turns her head towards the shouts</p>\n<h3 id=\"lot\" tabindex=\"-1\">Lot <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#lot\">#</a></h3>\n<p>Her turn cuts the shot to an empty parking lot at night. She’s now sitting, staring up at a florescent light, coming from a single streetlamp. She’s in different clothes, a heather gray sweatshirt and gym shorts, she sits between the headlights of a car, her back resting against the front bumper. The electric buzz of the lamp rolls in and behind her the muffled yelling she had heard before returns more clearly; it’s a muffled male voice, angrily shouting her name but goes quiet moments later. She reaches her arms over to cover the headlights on either side of her, creating red outlines around her hand and darkening her face. There’s nothing visible beyond what’s lit by the street lamp and the car headlights and in fact, the parking lot looks a lot like an island suspended in the void. The asphalt is cracked and ribbed from the movement of earth underneath it. The light hum of a small engine enters soon after. The scene cuts to Clover walking away from the car. A door behind her opens and the car door bell begins ringing. Christ steps out of the car.</p>\n<p><strong>Chris:</strong> “Clove! Where are you going!?” An irritated voice behind her yells “Why are you doing this? We can talk in the car - Clove! - what is wrong with you?” Clover turns around.</p>\n<p><strong>Clover</strong>: “Do you fucking think it’s okay for you to act that way around my family?” Clover’s yelling. Her voice strains from holding back tears and so it comes out in bursts. While she says this her eyes dark around the silhouette of the figure, partially blinded by the headlines she’s standing in front of. ”How fucking old are you? I’ve told you how much it hurts him - can’t you be fucking respectful- why can’t you - just apologize for once!?”</p>\n<p><strong>Ch</strong>: “What? Was I supposed to not say something while your brother just starts screaming at the top of his lungs at 2am? How was I supposed to know he had a thing? He was screaming all weekend.” Chris’s voice is just as loud but less uncertain. Clover walks backwards from the headlights.</p>\n<p><strong>C:</strong> “Go home. I don’t want to see you. I’ll get someone to pick me up, okay?” She takes a breath. “It’s fine, you can leave, Chris.” Clover looks less irritated and more exhausted from just yelling itself.</p>\n<p><strong>Ch:</strong> “I told you I forgot, okay? I hadn’t slept in 2 nights! I wasn’t mad at him, I just wanted him to know there were people trying to sleep - I’m sorry, okay?” For the first time we see his face, in a close up lit by the light on within the opened car. Chris has curly brown hair and is wearing thick glasses. He’s upset too, his face is tense and his lips pursed as his starts to say something but stops before the first word. He tries again, his eyes no longer looking at Clover in the headlights. He anxiously looks up at the streetlight and behind him and shifts uncomfortably in his jacket. “Clover, I’m really sorry it was late and I got worked up trying to stay cool about it all. I should have talked to you about it before. I...”</p>\n<p><strong>C:</strong> “Why is it that only now do you apologize for this kind of stuff? You wait until the last minute to say something - which is usually insulting and insensitive - and then only after I get upset and talk to you about it do you even consider you were wrong. You weren’t like this before, Chris.” She says the last line more quietly.</p>\n<p><strong>Ch:</strong> “I’m tired of this, you aren’t always right Clover. There are somethings that normal people can’t be expected to deal with. I can’t be sensitive to everything you are or I’d be living your life! I have my own life and some things bother me - like they would bother everyone else! I honestly don’t care that you have your own world, just don’t bring me into it. Don’t try to make everyone feel like you, ok? That’s the problem.” Clover looks up in deep odium. Her dark brown eyes are sunken in dark pools around her eyes. Her eyebrows furrow and she tucks her long brown hair behind her ears with a sigh. She stares up at the night sky. Even more tiredly, Clover responds.</p>\n<p><strong>C:</strong> “Look, Chris, I don’t know. I don’t know at what point something becomes disrespectful. But I know that there are other people living different lives. You and I are great examples of this. There’s been just enough tolerance between us for it to work so far. And I’ve never tried to make you feel the same way as me. I can’t imagine I’ve asked for a lot of sympathy, since it’s usually met with some long explanation about how it’s “unrealistic” for me to be feeling this way! But it’s just not worth arguing at some point if we can’t even relate to the events happening in our lives.” Clover looks back up at the sky for relief. “Yeah, know what, you might be right - I feel like I’m up on the moon sometimes and you’re on the total opposite side of Earth. And we’re always rotating and I’m always walking around trying to figure where the hell you are and you’re just sitting, sitting there watching me as you swing around and pass me again and again.”</p>\n<p><strong>Ch:</strong> “What can I do, Clover?” Chris hold his hands in the air, waiting for Clover to respond.</p>\n<p>Clover turns her back to the car and Chris and her face quickly tightens up and tears begin in well up in her eyes. She starts to pace away from the car and move across the parking lot, the light behind her now. The height of the shot elevates slowly from her shuffling sneakers, her tense hands gripping her phone, onto her face, still crying. Over her shoulder, we can see the blurry figure of a person leaning out from the open door of the driver’s seat of the sedan. The sound of Chris’s voice fades and echoes across the parking lot, we can still hear him yelling out for her as she begins to run. The sedan cranks on and drives away. Clover’s runs out of the light from parking lot. She pulls out her phone and turns on the flashlight. Both the light from the screen and from the flash illuminate her. Clover looks up from her phone and the shot cuts to a forest at the edge of the lot. She tops walking for a moment to stare up at it in awe. The sounds of the scene and a low drone rises up as if emanating from the forest itself, getting fuller and loud. As it does, Diane’s response returns in the darkness and the drone dissipates in an instant.</p>\n<h3 id=\"office-1\" tabindex=\"-1\">Office <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#office-1\">#</a></h3>\n<p><strong>Diane:</strong> “So, what are those worlds like? Could you explain them to me a little bit? Are they like daydreams?” The shot returns to Diane’s office, where the conversation has continued.</p>\n<p><strong>Clover:</strong> “Kind of, yeah, they’re drawn from the past, or at least in the way I’m reminded of it.” She pauses and it cuts back to a focus on Clover sitting with Diane. “I like to think about it as salvaging. Scraps of memories that, just, stick out for one reason or another. Like, last night I was writing about a memory I had as a kid. I remember one morning watching my mom roll the trash can up the driveway; I was looking from the window of my parents’ bedroom. I must have been 5 or 6.” As Clover’s speaking, the angle rotates from her profile towards the window, focusing on a wisteria tree, climbing the edge of the office outside. It focuses on a bundle of its soft pink flowers hovering in front of the window. Clover continues with the focus now on the tree. “And I remember how I felt watching my mom. She had no idea I was watching her, and the event was so mundane, yet, it felt so weird at the time. Now I probably would call it something like being “contemplative”, which I wasn’t really ever. It was odd, it was like, the realization that my mom existed, as a person, in a world without me. Of course, I must have known that even then, but I had just never seen it so closely” Clover smiles as she finishes her story, Diane looks down at the pad in her hands and quickly takes one note.</p>\n<p><strong>D:</strong> “Huh, well, that’s a lot deeper than I was expecting. I don’t know why you’re a math major!” She giggles. “So how does that exactly make a world? Are you reminiscing or -”</p>\n<p><strong>C:</strong> “Yeah, I mean a bit? It’s hard not to when writing stories. I mean, I can’t not write from experience, right?” She pauses to think “What do you think? Should I stop? I think they give me a chance to reconnect? Or explore the what I remember of the past, now, being older and all.</p>\n<p><strong>D:</strong> “No, no, not at all. I think that’s wonderful, and therapeutic I’m sure! I was just curious how you felt about them and whether they felt good for you. That’s all.”</p>\n<p><strong>C:</strong> ”Yeah, I think - it’s just an exercise that I can tell myself is productive.” Clover leans her head on the arms of the sofa she’s sitting on. “Do you think about old memories often?”</p>\n<h3 id=\"suburbs\" tabindex=\"-1\">Suburbs <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#suburbs\">#</a></h3>\n<p>The scene cuts to Clover squeezing through the trimmed wall of a hedge. It’s midnight. Crickets and cicadas buzz loudly around the shuffle of Clover’s figure through snapping and whipping twigs that trail her. She walks onto a street of a neighborhood. She left the yard of a large brick house through a wall of vegetation that surrounds it.</p>\n<p><strong>C:</strong> “Come on!” She whispers loudly to the fern, and a second body bursts from the trimmed hedge. “Come on! Let’s go!”</p>\n<p><strong>Nico:</strong> “I’m coming! Ow, ow, was this the best route?” She frees her leg from the hedge and jogs over to Clover. “And more importantly, do you even know where’s the lake from here?”</p>\n<p><strong>C:</strong> “Well, I got here, didn’t I? I can figure my way over there too, or we’ll just be wandering the night till morning then.” She grins wide and tucks her loose brown hair, already in a bun, behind her ears. Clover is excited, unstressed and unrestrained. She pulls some earplugs from her pocket. “You brought yours too right? Don’t tell me you forgot?”</p>\n<p><strong>N:</strong> “I have it, I have it! she awkwardly pulls her iPod out from her back pocket and shakes it in front of Clover. “See, I don’t forget. I even put the songs you sent me on it. And, let me tell you, that took me hours, sooo-” Nico’s eyes float to the tree branches overhead as she trails off.</p>\n<p><strong>C:</strong> “Good! Now at least you have some good music on that thing” She grins and leans in with her headphones already in. “Let’s go!”</p>\n<p>At that moment, Clover puts in her headphones, quickly fidgets with her iPod and begins to dance in the middle of the street. Clover’s dance is goofy and a bit uncoordinated. She bobs and swings her arms around across the street, keeping her eyes and grin on Nico as she too, though much more slowly, set her iPod up to go as well. Clover dances over to Nico after a moment.</p>\n<p><strong>C:</strong> ”Oh, oh, okay so, open the playlist I sent you - I almost forgot - here, let’s me see, yeah, and there.” Clover smoothly works the iPod to the playlist, “Now... I’m going to press play at the same time as you and we should be in sync for as long as this playlist lasts!”</p>\n<p><strong>N:</strong> ”You mean you hadn’t put any music on yet?”</p>\n<p><strong>C:</strong> ”No! I was waiting for your slow ass!”</p>\n<p><strong>N:</strong> ”Then, what were you dancing to, weirdo?”</p>\n<p><strong>C:</strong> “You of course!” Nico smiles at this and shyly shakes her head. “Okay, ready yet?”</p>\n<p><strong>N:</strong> “How long is this playlist, again?”</p>\n<p><strong>C:</strong> “I think we’ll be good until 4 or 5am!”</p>\n<p><strong>N:</strong> “Oh my god,” Nico rolls her eyes. &quot;I hope your taste in music is as good as you said!”</p>\n<p>The camera swings to Clover who is already dancing down the street and it ascends upwards still keeping a focus on the street. Above the trees you can see the neighborhood fully enclosed within the branches of a suburban grove of oaks. The perspective gazes down at the street while moving forward, still hovering above the two bodies walking between the edges of the tree branches until the branches converge in a thicket and the shot fades to black.</p>\n<p>Nico and Clover are now center frame, walking along a road with fewer houses, street lights and trees, at the edge of the neighborhood. It’s much darker, with fewer street lamps along the street. Beside them is a plot of undeveloped land, where construction crews are in the middle of filling out the frames of 6 or 7 houses. The unfinished buildings stand like skeletons over the field. Clover points beyond the houses to a tree-line about half a mile away.</p>\n<p><strong>C:</strong> “Through there. I’m almost certain” She pulls out Nico’s left earbud to tell her.</p>\n<p><strong>N:</strong> “And you saw this pond where?</p>\n<p><strong>C:</strong> “ Online, I looked it up! It’s right on the other side of those trees! Someone said that the builders here wanted to buy that land but apparently someone privately owns that land and wouldn’t sell to them.”</p>\n<p><strong>N:</strong> “You sure about that?”</p>\n<p><strong>C:</strong> “Yeah, I mean, it was the only comment on Google. I’d say it’s about 50/50. Who knows.”</p>\n<p><strong>N:</strong> “That’s odd, maybe it’s a private fishing pond?”</p>\n<p><strong>C:</strong> “I’m not sure. But, whatever it is - I think there’s a dock in the middle. Did you bring something to swim in?” Clover smirks unevenly, waiting for Nico’s response.</p>\n<p><strong>N:</strong> “Oh please. Like I’m going to hop in a random pond in the middle at midnight.”</p>\n<p>Clover shrugs and keeps walking, now off-road, through the untrimmed yards of the new houses. Behind Clover, Nico is noticeably reserved, her arms are kept close to her heavy wool sweater and is hesitant, at first, to step off the road but eventually joins Clover. Clover, holds her hands up to the sky, swinging them back and forth as she’s singing along with current track on her headphones. Her voice sounds quiet next to the roar of insects that fills the field. Nico has caught up with Clover and both are now moving more cautiously as the tall, dense grass begins to hide their feet. They move in unison quietly, for a while. The sound of their steps is loud and make a satisfying crunch over dry reeds.</p>\n<p>Suddenly, Nico’s arms wrap Clover’s shoulders from behind, her head falling on a shoulder and they come to a stop before the tree-line. It’s playful and unexpected, and uncoordinated, causing the two to stumble forward and Clover’s earbuds to fall out. For the first time, the Clover’s bright countenance begins to sink as Nico’s hands come together over her chest. Clover takes a sharp breath in at Nico’s gesture. With the music gone, she starts reorient to the deafening sound around her and begins to look around at where she is as if unaware of how she got here. We stay here watching her and Nico for a while, who has retracted her arms to the tops of Clover’s shoulders and is also staring at the woods. As the growl grows, the scene cuts to outside Clover’s dorm, where she is still recovering from her sprint through the dorm.</p>\n<h3 id=\"home\" tabindex=\"-1\">Home <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#home\">#</a></h3>\n<p>Her breathing returns to normal. She begins to quickly walk towards the parking lot, where the sun has begun to set and gets into her car. From the inside of her old tan minivan, she pulls out her phone to dial and begins to drive out of the lot.</p>\n<p><strong>C:</strong> “Mom? You there? Is he alright? Is he okay? I’m driving over right now, okay?” She pauses to listen to a sharp voice through the phone “I know, I know you did. It’s okay. I’ll be there soon, okay? Ok? He’s going to be okay. I’m heading over. Don’t worry - yes, of course. I love you. Bye.”</p>\n<p>She turns on the emergency blinkers and speeds through the highway onto the offramp. Entering into a neighborhood, Clover swerves past stop signs and worried parents that watch front yards, some picking up the paper, rolling out the garbage bins, watering the yard, chatting, or holding back their kids from the accelerating vehicle. Crimson flashes of light begin to appear on her face as she finally slows down. Outside, theres a commotion around the front yard of a small single-story house. Police are trying to speak with an older woman who is sobbing on the brick steps of her house. Clover slams on the brakes in front of the lawn, opens her door and runs over, forgetting to close it in her haste.</p>\n<p><strong>C:</strong> “Mom, mom, what happened?!” Clover is holding her mother, Samantha, on the steps. She brushes Samantha’s gray hair from her face. Clover’s startled by the number of wrinkles under her mom’s eyes and hugs her close. Tears have collected in those wrinkles. “What happened, tell me. Did he have another episode.”\nSamantha: “He - he ran away, Clover. I tried to hold him and he ran away from me.” Clover notices the sanguine bruises on her face and blood on the edges on her mouth.</p>\n<p><strong>C:</strong> “Mom... what happened? Are you okay? Did he hit you? Why is there blood on your face?”</p>\n<p><strong>S:</strong> “Clover, clover, it’s alright, it’s okay you know he gets that way, it was my mistake to try and hold him - he was trying to escape. He was screaming and thrashing around in his room. I went in to see what was happening”</p>\n<p><strong>C:</strong> “No, mom, he’s never done that before. Did he run away? Where is he?”</p>\n<p><strong>S:</strong> “He - ran out through the back. I couldn’t chase him - he knocked me down! I’m sorry, Clover, I’m sorry.”</p>\n<p><strong>C:</strong> “Mom, its okay, it’s alright, we’re going to find him don’t worry. I’ll find him.”</p>\n<p>Clover turns around to two police officers, watching the scene and chatting on radio. Noticing that Clover has finished talking, a tall man with crew cut brown hair walks over.</p>\n<p><strong>P1:</strong> “Are you the sister of Cecil Dawning?”</p>\n<p><strong>C:</strong> “Yes”</p>\n<p><strong>P1:</strong> “Okay good, as your mom might have told you, your brother ran off about an hour ago from the back of your home, south.” The officer points through the house, over towards the woods that lie behind Clover’s neighborhood. “We are going to need to ask you some questions about your brother if you...” The officer’s voice trails off into the distance and the sound of crickets and cicadas rise.</p>\n<p>Clover is struck with fear. Her facial expression has changed as the shot returns to her face. Her eyes that were once looking in the direction of his finger, now seem to be looking nowhere, absent of focus. Her figure is outlined with an aura of flashing red and blue from the police car in the lawn.</p>\n<p>Suddenly, the shot seamlessly changes to night as she turns around towards the lawn. Everyone is gone, the police, their car, Samantha are all absent as clover continues to star into the distance. Her face is now lit by the moon overhead and its cool blue light covers the rest of the neighborhood. All colors are now in neutral shades of blue. The noise of the crickets and cicadas continue.</p>\n<p>Without notice of the change, Clover opens the screen door in front of her and begins to walk through her house. The house is pitch black. From over Clover’s shoulders, the only light that is shining through is that of the back door. It beams light across the living room where a cabinet has been toppled, spilling books and shattered ceramic and glass across the carpet floor. The sound of Diane’s voice breaks through the silence. It speaks over the current scene as the visuals continue.</p>\n<p><strong>D:</strong> “To answer your question Clover, I do think about my memories. Often, in the same way as you. Only I’ve have about twice your life to think about, twice as many decisions with slip-ups and joys. But you do get better at it, at least you care less about your frequent mistakes and more about the disturbances you’re convinced are unavoidable.”\nClover looks down at the mess but is uninterested having fallen under some sort of delirium. Her gaze returns to the door, and continues to walk through the living room.</p>\n<p><strong>C:</strong> “But do you ever fear that you’ll forget, one day? What will happen when there are no more clues to your memories. That sudden rush of the experiences you had forgotten when you hear an old voice, or see a face, are harder to recall, and even more dependent on the pure chance of bumping into those people or places I spent time with.”</p>\n<p>By the back door is another room, whose door is open. Clover walks up to the backdoor and looks left, into the open bedroom. There, in the center of the room is a bare mattress made visible by the light shining through a small window across from her, covered partially with the torn sheets. A mangled mess of clothes and trash are pilled in corners of the bedroom; nothing is in order. The walls are bare and speckled with small punctures. Besides the bed, there’s a dresser and old chair that’s been overturn. Clover looks over the disarray and takes a calm inhale. Now looking out from the ground of the bedroom, she turns away from the doorway and opens the backdoor to outside.</p>\n<p><strong>C:</strong> “I mean where do they go? Where is it all? The high-school dances and snacks my mom would bring me Saturday afternoons? Those cartoons I watched and all the hikes I spent sprinting up the mountain like a goat, falling and bleeding all over the car? Biking until the late evening wind sent me home, missing dinner, and staying up late with an assignment and never learning to plan ahead. Taking a nervous hand like I would a pillow at night. I mean, they’re all there. But their experience... it wasn’t poetic.” She trails off with a sigh.</p>\n<p>Looking outside her house, she’s confronted with a tall thicket of trees 20 feet from her. She turns back towards the inside of the house, where her turn returns the scene to daylight with its sound muffled, her mother’s cries and the police officer calling her name from the other side of the house are visible, asking her to come back to answer questions, and telling Clover they are already searching for her brother. Those sounds are muffled, and don’t puncture the sound of night. Interrupting the commotion at hand, she returns towards the forest, again transitioning to night, and bolts into the woods. The pitter-patter of crunching leaves can be heard even after the darkness of the woods obscures her.</p>\n<h3 id=\"forest\" tabindex=\"-1\">Forest <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#forest\">#</a></h3>\n<p>Cut to black. The sound of steps in on the forest floor are all that can be heard. Clover slowly becomes visible in the light of the moon that’s broken through the tree tops. The shot follows her from the front, the sound of footsteps crunching through the fallen leaves. The steps quietly multiply, and soon Clover’s steps aren’t the only ones in the forest. She stops for a moment and the other footsteps stop a half-second after her. Clover looks fear-struck, and begins to turn around but stops, her head bent at her shoulder. The air is cold. A close up of her lips show her breaths, warm clouds, entering and exiting through her mouth. Carefully, she returns her gaze ahead. She continues to walk forward and the sound of footsteps are now her own. Soon, Clover comes to a clearing. Rising from behind her back, a large, dark pond stretches before her. She walks towards the body of water. The scintillating shape of the moon, hovers over the surface of the pond. Towards the edge of the pond that Clover’s facing, there’s an old wooden dock. As she moves towards the dock, she begins to make out the outline of a person sitting at its end. She walks over to the edge and sits down, feet dangling over the edge. We watch the two from the beginning of the dock. Clover rests her head on the shoulder of the person she still hasn’t looked at yet. A close shot of Clover, whose face is lit by the pond’s clean reflection of the moonlight.</p>\n<p><strong>C:</strong> “Was I over-detailed in their descriptions?” She starts wearily, “How else was I supposed to remember? Build? Start again? Turn backwards? for the sake of a road ahead.” Her hands thrusting towards the pond air. “And now, they’re getting worn out and indiscernible - from the daily rotation of hormones and maddening routines, like a spool of tape. We’ve just dunked it in developer and pulled it out for a fresh exposure.” She inhales and exhales and a smooth breeze descends from the treetops over the water, “I wish I wasn’t still spending the mornings thawing out from sleep. Spending however many minutes remembering, again, where I was when I fell asleep and that my eyes are now open. I sit up, silence slowly rubs my back and I look over to grimace at all the things I’ve surrounded myself with.”</p>\n<p>Clover lays back against the dock, her eyes looking up at the stars. An owl starts to coo across the open air.</p>\n<p><strong>C:</strong> “But, I’ve been thinking, too, of frightening thoughts, with a gravity of their own. Where, if you’re careful and patient, you might be able to watch existence orbit around their place. They roam around the sky, these massive harmonies, passing through the day silently - undetected. Until, at last, someone looks up. They look up and there it is, the atmosphere stretched past the edges of your eyes. A sky, filled with dancers, the phantoms of new memory, all the days I’ve been searching for that I’d thought I lost. The planet starts to slip from the upturned head, maybe mine. And they begin dancing too! Oh! all those afternoons sought for their nothingness; our simple want that was patient past its years. Instead, we solemnly watched it pass, mysteriously, like a sun setting out of tune.” She smiles at the thought and stops. The figure that was sitting next to her is gone.</p>\n<p>Looking down unto the dock, the shot elevates until the dock, the lake and finally the forests come into view. The perspective continues to rise and the scene fades to black.</p>\n<h3 id=\"end\" tabindex=\"-1\">End <a class=\"header-anchor\" href=\"https://jackson.gd/blog/2018-11-02-43-rpm/#end\">#</a></h3>\n",
			"date_published": "2018-11-02T00:00:00Z"
		}
		
	]
}
